{
    "name": "Offender-Corpus",
    "locale": "en-US",
    "contextData": "./corpora/data_config/devices.json",
    "data": [
        {
            "intent": "user.approval",
            "utterances": [
                "yes",
                "okay",
                "ok",
                "sure",
                "go on",
                "yup",
                "you should"
            ]
        },
        {
            "intent": "user.negation",
            "utterances": [
                "no",
                "stop",
                "that's enough",
                "i don't want to",
                "don't",
                "nope",
                "you should not"
            ]
        },
        {
            "intent": "device.genericTip",
            "utterances": [
                "can you give me some tips to consume less",
                "i want to consume less",
                "what can i do to consume less",
                "tell me how i can consume less",
                "how can i save energy",
                "give me a tip"
            ],
            "answers": [
                "Be mindful with the air conditioning, especially in the warmer months. There are plenty of alternatives, ask me about the AC specifically!",
                "If you have space, try to hang your laundry to dry, instead of using the dryer.",
                "Heating water takes a lot of energy, accounting for about 14% of the average home electric bill! Prefer to wash your clothes in cold water.",
                "Installing efficient shower heads can help you cut hot water usage dramatically, saving an average of 330 kilowatt hours of electricity per year. That's around 80$ worth of savings!",
                "If you haven't already, gradually switch from incandescent bulbs to LED ones. LED bulbs are about six times more efficient !",
                "Adding insulation to your house is a good investment, because it will dramatically lower your cooling and heating bills! Look if your state offers some financial incentives for this renovation, they usually do.",
                "If you have a garden, plant some shade trees on the south and west sides of your house. They will shade your windows and walls from the hot summer sun and lower the air temperature around your home",
                "If you have a garden, consider planting an evergreen tree on the north side of your house. It will block biting winter winds!",
                "Have you ever considered going solar? If your rooftop gets a lot of unobstructed sunlight during the day, you could reduce or even eliminate your electric bill by installing solar panels.",
                "Be sure to turn off all the lights when you leave a room. You could also install a presence detector to turn them off when you leave.",
                "Try to exploit sunlight as much as you can, artificial light is expensive!",
                "Keeping your shower time to just 4 minutes can save you lots of energy, especially in the winter!",
                "When cooking, try boiling your kettle with the right amount of water you need. Any extra water that needs to be heated is money wasted!"

            ]
        },
        {
            "intent": "device.dailyOffender",
            "utterances": [
                "who's yesterday's offender",
                "who's the offender",
                "what device consumed the most yesterday",
                "who do i have to blame for my energy bills"
            ]
        },
        {
            "intent": "device.todayOffenderError",
            "utterances": [
                "who's today's offender",
                "what device consumed the most today",
                "what device is consuming the most"
            ],
            "answers": [
                "Sorry, I don't have enough data yet to tell you which device is the most consuming one for today",
                "Sorry, but I can't tell you yet. Ask me about yesterday's offender",
                "Sorry, I can only tell you about past offenders. For example, ask me about yesterday's one"
            ]
        },
        {
            "intent": "device.specificTip",
            "utterances": [
                "how can i consume less with the @device"
            ],
            "answers": [
                "For {{ device }}, you can {{ _data[entities.device.option].tips[0] }}. Do you want any more tips?",
                "For {{ device }}, you can {{ _data[entities.device.option].tips[1] }}. Do you want any more tips?",
                "For {{ device }}, you can {{ _data[entities.device.option].tips[2] }}. Do you want any more tips?"

            ]
        },
        {
            "intent": "device.offenderInfo",
            "utterances": [
                "how do you choose the daily offender",
                "what's a daily offender"
            ],
            "answers": [
                "After I have gathered all the devices' energy consumption, I choose as daily offender the one that consumed the most.\nDo you want to know how to save energy?"
            ]
        }
    ],
    "entities": {
        "device": {
            "options": {
                "dishwasher": ["dishwasher"],
                "washing-machine": ["washing machine", "washing-machine", "washy washy"],
                "ac": ["ac", "air conditioning"],
                "fridge": ["fridge", "refrigerator"],
                "dryer": ["dryer"],
                "oven": ["oven", "toaster", "broiler", "grill"],
                "microwave": ["microwave", "micro-wave"],
                "boiler": ["boiler", "water heater", "hot water heater"]
            }
        }
    }
}